Revit 2027 API
ViewSheet.GetCurrentRevision Method
 Returns the most recent numbered Revision shown on this ViewSheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetCurrentRevision()
Public Function GetCurrentRevision As ElementId
public:
ElementId^ GetCurrentRevision()
member GetCurrentRevision : unit -> ElementId
Return Value
ElementId
 The Id of the most recent numbered Revision shown on this ViewSheet or InvalidElementId if none are shown.
Remarks
 If the most recent Revision is not issued, Revit will typically use it as the default Revision for RevisionClouds placed on this ViewSheet. InvalidElementId will be returned if no Revisions are present. Revisions with RevisionNumberType.None will not be returned.
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace